In [1]:
import pandas as pd
import numpy as np
data = pd.DataFrame([[1,6.5,3],[1,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.5,3]])

In [2]:
data=data.dropna(axis=0,how='all')

In [3]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [4]:
frame = pd .DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],
                     columns=['d','a','b','c'])

In [5]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [6]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                 index=["Ohio","colardo","utah","newayork"],columns=['one','two','three','four'])

In [7]:
data

          one  two  three  four
Ohio        0    1      2     3
colardo     4    5      6     7
utah        8    9     10    11
newayork   12   13     14    15

In [8]:
data[['three','one']]

          three  one
Ohio          2    0
colardo       6    4
utah         10    8
newayork     14   12

In [9]:
frame = pd .DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],
                     columns=['d','a','b','c'])
frame=frame.sort_index(axis=1)

In [10]:
frame

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [11]:
frame.ix[:,val]

AttributeError: 'DataFrame' object has no attribute 'ix'

In [ ]:
data =pd.DataFrame([[1,6.5,3],[1,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.5,3]])

In [ ]:
data=data.dropna(how="all")

In [ ]:
data

In [ ]:
s={'ohio':500,'texas':900,"oregein":877,'utah':988}
sta = ['cal','ohio','oregein','texas']
f = pd.Series(s,index=sta)

In [ ]:
f

In [ ]:
arr = np.arange(12).reshape((3,4))
print(arr-arr[0])

In [ ]:
arr

In [ ]:
arr[0]

In [ ]:
a=[1,2,3]
b=[4,5,6]
c= a.extend(b)

In [ ]:
type(a)

In [ ]:
a.extend(b)

In [ ]:
b.extend(a)

In [ ]:
d = a.append(b)

In [ ]:
d

In [20]:
frame=pd.DataFrame({'a':[0,1,0,1],'b':[4,7,-3,2]})
frame.sort_values(by=['a','b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [21]:
"id"=[5,4,3,2,1]
"name"=['ali','kashif','hamza','asif','ali']
pd.DAtaFrame('id')

SyntaxError: can't assign to literal (<ipython-input-21-4fc0e8e1d626>, line 1)